移除守护模式
